package day04;

import java.util.Scanner;
import java.lang.Math;

public class Ex01 {
	
	static int pow(int num, int count) {
		int result = 1;
		for(int i = 0; i < count; i++) {
			result *= num;
		}
		return result;
	}

	public static void main(String[] args) {
		// 함수 : 특정 값을 만들어내는 수식(코드의 묶음)
		// x값에 따라서, 서로 다른 y값을 계산하여 반환하는 코드의 묶음
		// y = f(x)
		
		// 함수 = function = 기능
		
		int n1 = pow(2, 10);
		System.out.println("n1 : " + n1);
		
		//함수의 정의 : 함수의 형태를 정의한다. 반환자료형, 함수이름, 매개변수를 작성하고
		//			 함수가 실행되면 수행할 코드를 {}안쪽에 작성한다
		//			 함수는 마지막에 반환자료형에 맞는 값을 반드시 return해야 한다.
		
		// 함수의 호출 : 이미 정의되어 있는 함수의 이름을 부르면서(call) 인자값을 전달한다
		//			  함수를 호출하면 정의된 내용을 수행하고, 결과값을 호출자리로 반환한다
		//			 
		
		// 자바의 함수는 반드시 반환자료형에 명시된 값을 반환해야 한다
		// 제어문에 의해 분기가 나누어지더라도 반드시 반환값을 처리해주어야 한다
		
		// 연습문제 ) 정수의 절대값을 반환하는 함수 abs를 작성하여 테스트하세요
		// 여기서 함수 호출코드를 작성합니다.
		
		Scanner sc = new Scanner(System.in);
		
		
		int m1; 
		
		System.out.printf("정수를 입력하세요 : ");
		m1 = sc.nextInt();
		
		
		//결과를 출력합니다.
		System.out.println("절대값은 : " + Math.abs(m1));
		
	

	}
	
	// 절대값을 반환하는 함수를 여기 아래에 작성(정의) 합니다.
	

	
	
}






// pow() 함수는 y의 거듭제곱에 대한 x의 값을 게산
// 첫번째인자는 밑수이고, 두번째 인자는 지수입니다. (인자 : 원인이 되는값)
// 첫번째 인자는 num에 대입 두번째 인자는 count에 대입됨.
// int num, count는 매개변수라 불린다.(들어오는 값을 받아주는 변수, 서로 이어주는 매개체의 역할)
// 함수는 객체의 움직임(동작)을 묶어서 표현하는 단위.
// 상수는 항상 같은값을 가지는 수.

// static ~ : 함수의 정의 / 
// 함수의 이름은 겹치면 안되나, 겹칠 수 있는 조건이 자바에 존재 -> "오버로딩"
// 함수가 어떻게 정의되고 그것을 어떻게 반환하여 우리에게 보여지는지 확인할 필요가 있음 -> 특히 함수의 정의(과정)부분을 잘 볼것.
// 가급적 이름이 중복되는 것은 좋은 선택이 아님.
// 주는 값의 자료형과 받는 값의 자료형 모두 명확해야 한다.
// int n1 변수 선언/ static ~ 매개 변수 선언
// 매개체 : 중간에서 어떤 일을 맺어 주는 것.
// static~ staitc을 제외하고 기억하면 좋음.